{"backend": "tensorflow", "keras_version": "2.2.2", "config": {"output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 5, 2], "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "return_state": true, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "return_sequences": false, "units": 4, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "stateful": false, "name": "lstm_1", "kernel_regularizer": null, "recurrent_regularizer": null}, "name": "lstm_1", "class_name": "LSTM"}, {"inbound_nodes": [[["lstm_1", 0, 1, {}]]], "config": {"n": 5, "trainable": true, "name": "repeat_vector_1"}, "name": "repeat_vector_1", "class_name": "RepeatVector"}, {"inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "config": {"unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "return_state": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "return_sequences": true, "units": 4, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "stateful": false, "name": "lstm_2", "kernel_regularizer": null, "recurrent_regularizer": null}, "name": "lstm_2", "class_name": "LSTM"}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 2, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}, "name": "dense_1", "class_name": "Dense"}]}, "class_name": "Model"}