{"backend": "tensorflow", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 5, 2]}, "class_name": "InputLayer"}, {"name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "lstm_1", "recurrent_regularizer": null, "activation": "tanh", "return_sequences": false, "units": 4, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "go_backwards": false, "dropout": 0.0, "use_bias": true, "trainable": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}, "class_name": "LSTM"}, {"name": "repeat_vector_1", "inbound_nodes": [[["lstm_1", 0, 1, {}]]], "config": {"trainable": true, "name": "repeat_vector_1", "n": 5}, "class_name": "RepeatVector"}, {"name": "lstm_2", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "config": {"name": "lstm_2", "recurrent_regularizer": null, "activation": "tanh", "return_sequences": true, "units": 4, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "stateful": false, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "go_backwards": false, "dropout": 0.0, "use_bias": true, "trainable": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}, "class_name": "LSTM"}, {"name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 2, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.2", "class_name": "Model"}