{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 5, 2]}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"return_sequences": false, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_constraint": null, "trainable": true, "stateful": false, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "implementation": 1, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "unroll": false, "return_state": true, "activation": "tanh", "bias_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 5}, "inbound_nodes": [[["lstm_1", 0, 1, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"return_sequences": true, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_constraint": null, "trainable": true, "stateful": false, "unit_forget_bias": true, "use_bias": true, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "implementation": 1, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "unroll": false, "return_state": false, "activation": "tanh", "bias_constraint": null, "kernel_regularizer": null}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}